In [1]:
import numpy as np

In [3]:
a=np.array([[1,3423,325,4432],[342,23535,5,52]])
a

array([[    1,  3423,   325,  4432],
       [  342, 23535,     5,    52]])

In [4]:
a=np.array([(1,3423,325,4432),(99342,23535,5,52)])
a

array([[    1,  3423,   325,  4432],
       [99342, 23535,     5,    52]])

### Pandas
- It is also one of the most important modules of data science
- used to work with data in the form of frames/table
- stands for Panel Data
- Data Analysis,Manipulation and Cleaning
     - Data Analysis means analysing the data
        - Statistics of data,Volume of data etc
     - Data Manipulation means transforming the data from one data to another
        - Merging,Concatenating etc
     - Data Cleaning means removing the NUll Data
        - Null Data means NaN(Not a Number)
- data structures in pandas
    - Series
       -sequential data
    - Data Frame
       -Data in Tabular Format
- **Installation**
   - pip install pandas
   - import pandas

In [23]:
import pandas as pd

In [6]:
pd.__version__

'1.2.4'

In [7]:
#we can create series using str,tuple,list and dict

In [8]:
st="MY name is Sai"
pd.Series(st)

0    MY name is Sai
dtype: object

In [9]:
li=input("type collge name").split()
pd.Series(li)

type collge namevr siddhartha Enginerring College

0             vr
1     siddhartha
2    Enginerring
3        College
dtype: object

In [10]:
print(pd.Series(li))

0             vr
1     siddhartha
2    Enginerring
3        College
dtype: object

In [11]:
#using tuple/list
t=(6,4,64,6,4,641)
pd.Series(t)

0      6
1      4
2     64
3      6
4      4
5    641
dtype: int64

In [12]:
#using range
pd.Series(range(10,30,6))

0    10
1    16
2    22
3    28
dtype: int64

In [16]:
#using Dictionary
dic={"10":"Ten",12:34,"tuple":(9,8,"hi"),"list":[9,6,3]}
s=pd.Series(dic)
s

10              Ten
12               34
tuple    (9, 8, hi)
list      [9, 6, 3]
dtype: object

In [17]:
s.index

Index(['10', 12, 'tuple', 'list'], dtype='object')

In [18]:
import numpy as np

In [20]:
ar=np.arange(10,40,5)
ass=pd.Series(ar)
ass

0    10
1    15
2    20
3    25
4    30
5    35
dtype: int32

In [31]:
ass[:2]

4    10
5    15
dtype: int32

In [32]:
ass[:-1]

4      10
5      15
654    20
6      25
465    30
dtype: int32

In [21]:
ass.index=[4,5,654,6,465,9]

In [22]:
ass

4      10
5      15
654    20
6      25
465    30
9      35
dtype: int32

In [28]:
li2=[3,534,36,3,4,"hi"]
inx=[num for num in range(5,11)]
print(inx)
pd.Series(li2,index=inx)

[5, 6, 7, 8, 9, 10]

5       3
6     534
7      36
8       3
9       4
10     hi
dtype: object

In [29]:
#pass the user index to series created using Dictionary
#len(dic)
ix=[num for num in range(10,14)]
pd.Series(dic,index=ix)

10    NaN
11    NaN
12     34
13    NaN
dtype: object

In [26]:
dic={'10': 'Ten', 12: 34, 'tuple': (9, 8, 'hi'), 'list': [9, 6, 3]}

In [27]:
len(dic)

4

## Data Frames
-  Data is in 2d format

In [28]:
#dictionary into dataframe
df=pd.DataFrame(dic)
df

    10  12 tuple  list
0  Ten  34     9     9
1  Ten  34     8     6
2  Ten  34    hi     3

In [29]:
print(pd.DataFrame(dic))

    10  12 tuple  list
0  Ten  34     9     9
1  Ten  34     8     6
2  Ten  34    hi     3

In [30]:
dic

{'10': 'Ten', 12: 34, 'tuple': (9, 8, 'hi'), 'list': [9, 6, 3]}

In [38]:
data={"int":90,"float":70.464,"str":"sfgggfr","prgm":"fufgsi"}
df2=pd.DataFrame(data,index=[1,2,4])
df2

   int   float      str    prgm
1   90  70.464  sfgggfr  fufgsi
2   90  70.464  sfgggfr  fufgsi
4   90  70.464  sfgggfr  fufgsi

In [32]:
pd.concat([df,df2])

    10    12 tuple  list   int   float      str    prgm
0  Ten  34.0     9   9.0   NaN     NaN      NaN     NaN
1  Ten  34.0     8   6.0   NaN     NaN      NaN     NaN
2  Ten  34.0    hi   3.0   NaN     NaN      NaN     NaN
1  NaN   NaN   NaN   NaN  90.0  70.464  sfgggfr  fufgsi
2  NaN   NaN   NaN   NaN  90.0  70.464  sfgggfr  fufgsi
4  NaN   NaN   NaN   NaN  90.0  70.464  sfgggfr  fufgsi

In [33]:
import pandas as pd
df3=pd.DataFrame({"int_rate":[2,2,131,43],"Int_gdp":[3,24,4432,4]})
df3

   int_rate  Int_gdp
0         2        3
1         2       24
2       131     4432
3        43        4

In [34]:
df4=pd.DataFrame({"int_tier":[2,2,131,43],"Int_unemployment":[3,24,4432,4]},index=[6,44,64,46])
df4

    int_tier  Int_unemployment
6          2                 3
44         2                24
64       131              4432
46        43                 4

In [35]:
pd.concat([df3,df4])

    int_rate  Int_gdp  int_tier  Int_unemployment
0        2.0      3.0       NaN               NaN
1        2.0     24.0       NaN               NaN
2      131.0   4432.0       NaN               NaN
3       43.0      4.0       NaN               NaN
6        NaN      NaN       2.0               3.0
44       NaN      NaN       2.0              24.0
64       NaN      NaN     131.0            4432.0
46       NaN      NaN      43.0               4.0

In [36]:
#merging two data frames
df3.join(df4)

   int_rate  Int_gdp  int_tier  Int_unemployment
0         2        3       NaN               NaN
1         2       24       NaN               NaN
2       131     4432       NaN               NaN
3        43        4       NaN               NaN

In [39]:
m=pd.DataFrame({"a":[1,2,3,4],"b":[20,30,40,50],"c":['a','b','v','d']},index=['1st','2nd','3rd','4th'])
m

     a   b  c
1st  1  20  a
2nd  2  30  b
3rd  3  40  v
4th  4  50  d

In [40]:
n=pd.DataFrame({"a":[1,5,3,4],"b":[20,70,40,50],"c":['a','b','v','d']},index=['1st','2nd','3rd','4th'])
n

     a   b  c
1st  1  20  a
2nd  5  70  b
3rd  3  40  v
4th  4  50  d

In [41]:
m.merge(n)

   a   b  c
0  1  20  a
1  3  40  v
2  4  50  d

In [42]:
new=m.merge(n)
new.columns=[12,13,"fdgf"]
new.index=[3,4,5]
new

   12  13 fdgf
3   1  20    a
4   3  40    v
5   4  50    d

In [43]:
new=m.merge(n)
new.rows=[12,13,"fdgf"]
new.index=[3,4,5]
new

<ipython-input-43-23e2d3d34f13>:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  new.rows=[12,13,"fdgf"]

   a   b  c
3  1  20  a
4  3  40  v
5  4  50  d

In [44]:
m.merge(n,on='c')

   a_x  b_x  c  a_y  b_y
0    1   20  a    1   20
1    2   30  b    5   70
2    3   40  v    3   40
3    4   50  d    4   50

In [45]:
dates=pd.date_range('2022-01-01','2022-01-10')
pd.Series(dates)

0   2022-01-01
1   2022-01-02
2   2022-01-03
3   2022-01-04
4   2022-01-05
5   2022-01-06
6   2022-01-07
7   2022-01-08
8   2022-01-09
9   2022-01-10
dtype: datetime64[ns]

In [46]:
dt=pd.date_range('2022-01-01',periods=5)
pd.Series(dt)

0   2022-01-01
1   2022-01-02
2   2022-01-03
3   2022-01-04
4   2022-01-05
dtype: datetime64[ns]

In [47]:
temp=[30,40,50,60,70]
pd.Series(temp,index=dt)

2022-01-01    30
2022-01-02    40
2022-01-03    50
2022-01-04    60
2022-01-05    70
Freq: D, dtype: int64

In [48]:
new.index[1]

4

## Working with .csv file
- reading .csv file located at same location
- pd.read

In [49]:
dir(pd)

['BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_is_numpy_dev',
 '_lib',
 '_libs',
 '_np_version_under1p17',
 '_np_version_under1p18',
 '_testing',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [116]:
marks=pd.read_csv('marks.csv')
marks

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        30  23  50.0  40.0
1   A2    Y     61        30  23  51.0  40.0
2   A3    Z     62        30  23  52.0  40.0
3   A4    A     63        30  23  53.0  40.0
4   A5    B     64        30  23   NaN   NaN
5   A6    C     65        30  23  55.0  40.0
6   A7    D     66        30  23  56.0  40.0
7   A8    E     67        30  23  57.0  40.0
8   A9    F     68        30  23  58.0  40.0

In [51]:
marks.sample()

  Roll Name  Maths  Discrete  OS  CO  DS
4   A5    B     64        30  23  54  40

In [52]:
marks.sample(3)#3 random samples

  Roll Name  Maths  Discrete  OS  CO  DS
7   A8    E     67        30  23  57  40
5   A6    C     65        30  23  55  40
4   A5    B     64        30  23  54  40

In [53]:
marks.head() #first five samples

  Roll Name  Maths  Discrete  OS  CO  DS
0   A1    X     60        30  23  50  40
1   A2    Y     61        30  23  51  40
2   A3    Z     62        30  23  52  40
3   A4    A     63        30  23  53  40
4   A5    B     64        30  23  54  40

In [56]:
marks.head(3) #first 3 samples

  Roll Name  Maths  Discrete  OS  CO  DS
0   A1    X     60        30  23  50  40
1   A2    Y     61        30  23  51  40
2   A3    Z     62        30  23  52  40

In [55]:
marks.tail()#last 5 samples

  Roll Name  Maths  Discrete  OS  CO  DS
4   A5    B     64        30  23  54  40
5   A6    C     65        30  23  55  40
6   A7    D     66        30  23  56  40
7   A8    E     67        30  23  57  40
8   A9    F     68        30  23  58  40

In [57]:
marks.tail(3) #last 3 samples

  Roll Name  Maths  Discrete  OS  CO  DS
6   A7    D     66        30  23  56  40
7   A8    E     67        30  23  57  40
8   A9    F     68        30  23  58  40

In [58]:
# accesing one particular col data
marks['Roll']

0    A1
1    A2
2    A3
3    A4
4    A5
5    A6
6    A7
7    A8
8    A9
Name: Roll, dtype: object

In [62]:
marks[['Roll','Name','OS']] #getting required multiple col values

  Roll Name  OS
0   A1    X  23
1   A2    Y  23
2   A3    Z  23
3   A4    A  23
4   A5    B  23
5   A6    C  23
6   A7    D  23
7   A8    E  23
8   A9    F  23

In [65]:
new=pd.read_csv('marks.csv',usecols=['Name','CO'])
new

  Name  CO
0    X  50
1    Y  51
2    Z  52
3    A  53
4    B  54
5    C  55
6    D  56
7    E  57
8    F  58

In [66]:
marks.columns

Index(['Roll', 'Name', 'Maths', 'Discrete', 'OS', 'CO', 'DS'], dtype='object')

In [68]:
marks.index

RangeIndex(start=0, stop=9, step=1)

In [69]:
marks.info # textual information like printing

<bound method DataFrame.info of   Roll Name  Maths  Discrete  OS  CO  DS
0   A1    X     60        30  23  50  40
1   A2    Y     61        30  23  51  40
2   A3    Z     62        30  23  52  40
3   A4    A     63        30  23  53  40
4   A5    B     64        30  23  54  40
5   A6    C     65        30  23  55  40
6   A7    D     66        30  23  56  40
7   A8    E     67        30  23  57  40
8   A9    F     68        30  23  58  40>

In [70]:
marks.dtypes

Roll        object
Name        object
Maths        int64
Discrete     int64
OS           int64
CO           int64
DS           int64
dtype: object

In [67]:
marks.info

<bound method DataFrame.info of   Roll Name  Maths  Discrete  OS  CO  DS
0   A1    X     60        30  23  50  40
1   A2    Y     61        30  23  51  40
2   A3    Z     62        30  23  52  40
3   A4    A     63        30  23  53  40
4   A5    B     64        30  23  54  40
5   A6    C     65        30  23  55  40
6   A7    D     66        30  23  56  40
7   A8    E     67        30  23  57  40
8   A9    F     68        30  23  58  40>

In [73]:
marks.describe() # statistics of the data

           Maths  Discrete    OS         CO    DS
count   9.000000       9.0   9.0   9.000000   9.0
mean   64.000000      30.0  23.0  54.000000  40.0
std     2.738613       0.0   0.0   2.738613   0.0
min    60.000000      30.0  23.0  50.000000  40.0
25%    62.000000      30.0  23.0  52.000000  40.0
50%    64.000000      30.0  23.0  54.000000  40.0
75%    66.000000      30.0  23.0  56.000000  40.0
max    68.000000      30.0  23.0  58.000000  40.0

In [74]:
marks.Maths.value_counts() #frequency of value

64    1
65    1
66    1
67    1
68    1
60    1
61    1
62    1
63    1
Name: Maths, dtype: int64

In [77]:
marks['Maths'].value_counts()

64    1
65    1
66    1
67    1
68    1
60    1
61    1
62    1
63    1
Name: Maths, dtype: int64

In [76]:
marks['CO'].value_counts()

50    1
51    1
52    1
53    1
54    1
55    1
56    1
57    1
58    1
Name: CO, dtype: int64

In [78]:
marks.shape

(9, 7)

In [79]:
marks.sort_values('Maths')

  Roll Name  Maths  Discrete  OS  CO  DS
0   A1    X     60        30  23  50  40
1   A2    Y     61        30  23  51  40
2   A3    Z     62        30  23  52  40
3   A4    A     63        30  23  53  40
4   A5    B     64        30  23  54  40
5   A6    C     65        30  23  55  40
6   A7    D     66        30  23  56  40
7   A8    E     67        30  23  57  40
8   A9    F     68        30  23  58  40

In [80]:
marks.sort_values('Roll',ascending=False)

  Roll Name  Maths  Discrete  OS  CO  DS
8   A9    F     68        30  23  58  40
7   A8    E     67        30  23  57  40
6   A7    D     66        30  23  56  40
5   A6    C     65        30  23  55  40
4   A5    B     64        30  23  54  40
3   A4    A     63        30  23  53  40
2   A3    Z     62        30  23  52  40
1   A2    Y     61        30  23  51  40
0   A1    X     60        30  23  50  40

In [81]:
# adding new col into df
marks['Total']=100

In [82]:
marks

  Roll Name  Maths  Discrete  OS  CO  DS  Total
0   A1    X     60        30  23  50  40    100
1   A2    Y     61        30  23  51  40    100
2   A3    Z     62        30  23  52  40    100
3   A4    A     63        30  23  53  40    100
4   A5    B     64        30  23  54  40    100
5   A6    C     65        30  23  55  40    100
6   A7    D     66        30  23  56  40    100
7   A8    E     67        30  23  57  40    100
8   A9    F     68        30  23  58  40    100

In [90]:
marks.Maths.sum() # summation of one col

576

In [95]:
marks.sum()

Roll        A1A2A3A4A5A6A7A8A9
Name                 XYZABCDEF
Maths                      576
Discrete                   270
OS                         207
CO                         486
DS                         360
Total                     4698
dtype: object

In [92]:
marks['Total']=marks.sum(1)
marks

  Roll Name  Maths  Discrete  OS  CO  DS  Total
0   A1    X     60        30  23  50  40    506
1   A2    Y     61        30  23  51  40    510
2   A3    Z     62        30  23  52  40    514
3   A4    A     63        30  23  53  40    518
4   A5    B     64        30  23  54  40    522
5   A6    C     65        30  23  55  40    526
6   A7    D     66        30  23  56  40    530
7   A8    E     67        30  23  57  40    534
8   A9    F     68        30  23  58  40    538

In [94]:
marks.sum(1)

0    709
1    715
2    721
3    727
4    733
5    739
6    745
7    751
8    757
dtype: int64

In [96]:
marks.isnull()

    Roll   Name  Maths  Discrete     OS     CO     DS  Total
0  False  False  False     False  False  False  False  False
1  False  False  False     False  False  False  False  False
2  False  False  False     False  False  False  False  False
3  False  False  False     False  False  False  False  False
4  False  False  False     False  False  False  False  False
5  False  False  False     False  False  False  False  False
6  False  False  False     False  False  False  False  False
7  False  False  False     False  False  False  False  False
8  False  False  False     False  False  False  False  False

In [97]:
marks.isna()

    Roll   Name  Maths  Discrete     OS     CO     DS  Total
0  False  False  False     False  False  False  False  False
1  False  False  False     False  False  False  False  False
2  False  False  False     False  False  False  False  False
3  False  False  False     False  False  False  False  False
4  False  False  False     False  False  False  False  False
5  False  False  False     False  False  False  False  False
6  False  False  False     False  False  False  False  False
7  False  False  False     False  False  False  False  False
8  False  False  False     False  False  False  False  False

In [104]:
marks.pop('Total')

0    406
1    410
2    414
3    418
4    422
5    426
6    430
7    434
8    438
Name: Total, dtype: int64

In [105]:
marks

  Roll Name  Maths  Discrete  OS  CO  DS
0   A1    X     60        30  23  50  40
1   A2    Y     61        30  23  51  40
2   A3    Z     62        30  23  52  40
3   A4    A     63        30  23  53  40
4   A5    B     64        30  23  54  40
5   A6    C     65        30  23  55  40
6   A7    D     66        30  23  56  40
7   A8    E     67        30  23  57  40
8   A9    F     68        30  23  58  40

In [110]:
marks['Total']=marks.sum(1)

In [111]:
marks

  Roll Name  Maths  Discrete  OS  CO  DS  Total
0   A1    X     60        30  23  50  40    609
1   A2    Y     61        30  23  51  40    615
2   A3    Z     62        30  23  52  40    621
3   A4    A     63        30  23  53  40    627
4   A5    B     64        30  23  54  40    633
5   A6    C     65        30  23  55  40    639
6   A7    D     66        30  23  56  40    645
7   A8    E     67        30  23  57  40    651
8   A9    F     68        30  23  58  40    657

In [117]:
marks.isnull().sum() #sum of null elements

Roll        0
Name        0
Maths       0
Discrete    0
OS          0
CO          1
DS          1
dtype: int64

In [118]:
marks.nunique() #no.of unique elements

Roll        9
Name        9
Maths       9
Discrete    1
OS          1
CO          8
DS          1
dtype: int64

In [119]:
marks.dropna()

  Roll Name  Maths  Discrete  OS    CO    DS
0   A1    X     60        30  23  50.0  40.0
1   A2    Y     61        30  23  51.0  40.0
2   A3    Z     62        30  23  52.0  40.0
3   A4    A     63        30  23  53.0  40.0
5   A6    C     65        30  23  55.0  40.0
6   A7    D     66        30  23  56.0  40.0
7   A8    E     67        30  23  57.0  40.0
8   A9    F     68        30  23  58.0  40.0